callBranchService/SOA/WSDLs/getBranchDetail.wsdl

<wsdl:definitions
     name="getBranchDetail"
     targetNamespace="http://xmlns.oracle.com/pcbpel/adapter/http/bpel-process/callBranchService/getBranchDetail"
     xmlns:tns="http://xmlns.oracle.com/pcbpel/adapter/http/bpel-process/callBranchService/getBranchDetail"
     xmlns:plt="http://schemas.xmlsoap.org/ws/2003/05/partner-link/"
     xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
     xmlns:msg_in_out="http://xmlns.oracle.com/bpel_process/callBranchService/getBranchDetail"
    >
  <plt:partnerLinkType name="getBranchDetail_plt" >
    <plt:role name="getBranchDetail_role" >
      <plt:portType name="tns:getBranchDetail_ptt" />
    </plt:role>
  </plt:partnerLinkType>
    <wsdl:types>
      <schema xmlns="http://www.w3.org/2001/XMLSchema" >
        <import namespace="http://xmlns.oracle.com/bpel_process/callBranchService/getBranchDetail" schemaLocation="../Schemas/getBranchDetail.xsd" />
      </schema>
    </wsdl:types>
    <wsdl:message name="Body_msg_in">
        <wsdl:part name="Body" element="msg_in_out:Body"/>
    </wsdl:message>
    <wsdl:message name="GetResponse_msg_out">
        <wsdl:part name="GetResponse" element="msg_in_out:GetResponse"/>
    </wsdl:message>
    <wsdl:portType name="getBranchDetail_ptt">
        <wsdl:operation name="getBranchDetail">
            <wsdl:input message="tns:Body_msg_in"/>
            <wsdl:output message="tns:GetResponse_msg_out"/>
        </wsdl:operation>
    </wsdl:portType>
</wsdl:definitions>
